for i in 1..10 do # "1..10"は、1～10までの範囲を表す
  puts i
end

# for 変数 in 範囲、ハッシュ、配列などを指定 do
#  処理
# end

#「1..10」の部分を範囲オブジェクトというよ。また、「1…10」という風にドット3つで指定すると範囲に10は含まれなくなるんだ。


#++++++++++++++++++++++++++++++++++++++++++
#array = [1,2,3,4,5]
 
# for i in array do
#  puts i
# end

#++++++++++++++++++++++++++++++++++++++++++
# for i in 1..5 do                
#  if i == 4
#    next
#  end                                 →1、2、3、5
#  puts i
#  end
#++++++++++++++++++++++++++++++++++++++++++
# for i in 1..5 do
#  if i == 4
#    break
#  end
#  p i
#end